src/ut10_old/InformationRegisters/СтавкиОсновныхВидовРасчетовСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>СтавкиОсновныхВидовРасчетовСотрудников</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРасчетовССотрудниками</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ut10_old/InformationRegisters/ИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИзменённыйЭлемент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ut10_old/InformationRegisters/СтавкиОсновныхВидовРасчетовСотрудников/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Для каждого Запись Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(Запись.Сотрудник) Тогда
			Отказ = Истина;
			СтрокаОтказа = "Не заполнено Физлицо.";
			Продолжить;
		КонецЕсли; 
		Если Запись.Сотрудник.ЭтоГруппа Тогда
			Отказ = Истина;
			СтрокаОтказа = "Нельзя использовать в качестве физлица группу!";
			Прервать;
		КонецЕсли;
		Сотрудник=Запись.Сотрудник;
	КонецЦикла;
	
	Если Отказ Тогда                  
		Сообщить(СтрокаОтказа); 
    Иначе
		 ЗаписатьИсторию(ЭтотОбъект, Сотрудник);
	КонецЕсли; 
	
КонецПроцедуры

//ЛК Андрей Добавление истории у этого регистира=======
Процедура ЗаписатьИсторию(ЭтотОбъект, Сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.Текст="ВЫБРАТЬ
	|	СтавкиОсновныхВидовРасчетовСотрудников.Сумма,
	|	СтавкиОсновныхВидовРасчетовСотрудников.ВидРасчета,
	|	СтавкиОсновныхВидовРасчетовСотрудников.Регистратор
	|ИЗ
	|	РегистрСведений.СтавкиОсновныхВидовРасчетовСотрудников КАК СтавкиОсновныхВидовРасчетовСотрудников
	|ГДЕ
	|	СтавкиОсновныхВидовРасчетовСотрудников.Сотрудник = &Сотрудник";
	Запрос = Запрос.Выполнить().Выгрузить();
	Для каждого Запись Из ЭтотОбъект Цикл
		Новое=Истина;
		Для каждого Строчка из Запрос Цикл 
			Если Запись.ВидРасчета=Строчка.ВидРасчета И Строка(Запись.ВидРасчета)<>"Оклад стажера (за смену)" Тогда 
				Новое=Ложь;
				Если Запись.Сумма<>Строчка.Сумма Тогда   //Если запись просто меняют.
						НаборЗаписей = РегистрыСведений.ИсторияСотрудников.СоздатьНаборЗаписей(); 
						НоваяЗапись = НаборЗаписей.Добавить();
						НоваяЗапись.Дата=ТекущаяДата();
						НоваяЗапись.Событие=Строка(Строчка.Сумма)+" -> "+Строка(Запись.Сумма);
						НоваяЗапись.ИзменённыйЭлемент=Запись.ВидРасчета;
						НоваяЗапись.Сотрудник=Запись.Сотрудник;
						НоваяЗапись.Пользователь=Пользователи.ТекущийПользователь();
						НаборЗаписей.Записать(Ложь);
				КонецЕсли; 
			КонецЕсли;
		КонецЦикла;
		
		Если Новое=Истина И Строка(Запись.ВидРасчета)<>"Оклад стажера (за смену)"Тогда   //Если записи не было в регистре и это новая.
				НаборЗаписей = РегистрыСведений.ИсторияСотрудников.СоздатьНаборЗаписей(); 
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Дата=ТекущаяДата();
				НоваяЗапись.Событие="Новая запись: "+Строка(Запись.Сумма);
				НоваяЗапись.ИзменённыйЭлемент=Запись.ВидРасчета;  
				НоваяЗапись.Сотрудник=Сотрудник;
				НоваяЗапись.Пользователь=Пользователи.ТекущийПользователь();
				НаборЗаписей.Записать(Ложь);

		КонецЕсли;
	КонецЦикла;
	
	Для каждого Строчка из Запрос Цикл
		Удаленное=Истина; 	
		Для каждого Запись Из ЭтотОбъект Цикл
			Если Запись.ВидРасчета=Строчка.ВидРасчета Тогда 
				Удаленное=Ложь;
			КонецЕсли;
		КонецЦикла; 
		Если Удаленное=Истина И Строка(Строчка.ВидРасчета)<>"Оклад стажера (за смену)" Тогда  //Если запись была в регистре, но в новых записях её нет, значит она удалена. 
				НаборЗаписей = РегистрыСведений.ИсторияСотрудников.СоздатьНаборЗаписей(); 
				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.Дата=ТекущаяДата();
				НоваяЗапись.Событие="Удалена запись с суммой: "+Строка(Строчка.Сумма);
				НоваяЗапись.ИзменённыйЭлемент=Строчка.ВидРасчета;
				НоваяЗапись.Сотрудник=Сотрудник;
				НоваяЗапись.Пользователь=Пользователи.ТекущийПользователь();
				НаборЗаписей.Записать(Ложь);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
//=====================================================
